tap "buo/cask-upgrade"
tap "danielgatis/imgcat"
tap "persiliao/tap"
tap "retlehs/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interface bandwidth monitor
brew "bmon"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Program that can automate interactive applications
brew "expect"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Core application library for C
brew "glib"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Ranger-like terminal file manager written in Rust
brew "joshuto"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Fast and simple video downloader
brew "lux"
# Menu-driven communications program
brew "minicom"
# Deep clean and optimize your Mac
brew "mole"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Open source visual route tracking CLI tool
brew "nexttrace"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wraps rm to prevent dangerous deletion of files
brew "safe-rm"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Log file highlighter
brew "tailspin"
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A better whois and domain intelligence toolkit
brew "retlehs/tap/quien"
# User-friendly GUI app for Homebrew
cask "applite"
# Remote desktop control and monitoring tool
cask "awesun"
# Write, edit, and chat about your code with AI
cask "cursor"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Dictionary and translator app
cask "easydict"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# Utility to open, create and modify archive files
cask "maczip"
# Markdown editor
cask "markedit"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Customise and maintain app icons
cask "pictogram"
# Control your tools with a few keystrokes
cask "raycast"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Messaging app with a focus on speed and security
cask "telegram"
# Free messaging and calling application
cask "wechat"
# Network protocol analyzer
cask "wireshark-app"
vscode "adpyke.codesnap"
vscode "christian-kohler.path-intellisense"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mhutchie.git-graph"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "ryu1kn.partial-diff"
vscode "usernamehw.errorlens"
vscode "yzhang.markdown-all-in-one"
